IRP/src/Catalogs/FileStorageVolumes/FileStorageVolumes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>FileStorageVolumes</name>
  <attributes>
    <name>FilesType</name>
    <type>
      <types>EnumRef.FileTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>POSTIntegrationSettings</name>
    <type>
      <types>CatalogRef.IntegrationSettings</types>
    </type>
  </attributes>
  <attributes>
    <name>GETIntegrationSettings</name>
    <type>
      <types>CatalogRef.IntegrationSettings</types>
    </type>
  </attributes>
  <attributes>
    <name>UsePreview1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Preview1POSTIntegrationSettings</name>
    <type>
      <types>CatalogRef.IntegrationSettings</types>
    </type>
  </attributes>
  <attributes>
    <name>Preview1GETIntegrationSettings</name>
    <type>
      <types>CatalogRef.IntegrationSettings</types>
    </type>
  </attributes>
  <attributes>
    <name>Preview1Sizepx</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

IRP/src/Enums/FileTypes/FileTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>FileTypes</name>
  <enumValues>
    <name>Picture</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/FileStorageVolumes/Forms/ItemForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	SetVisible();
EndProcedure

&AtClient
Procedure FilesTypeOnChange(Item)
	SetVisible();
EndProcedure

&AtClient
Procedure UsePreview1OnChange(Item)
	SetVisible();
EndProcedure

&AtServer
Procedure SetVisible()
	Items.UsePreview1.Visible = (Object.FilesType = Enums.FileTypes.Picture);
	Items.Preview1POSTIntegrationSettings.Visible = (Object.FilesType = Enums.FileTypes.Picture) And Object.UsePreview1;
	Items.Preview1GETIntegrationSettings.Visible = (Object.FilesType = Enums.FileTypes.Picture) And Object.UsePreview1;
	Items.Preview1Sizepx.Visible = (Object.FilesType = Enums.FileTypes.Picture) And Object.UsePreview1;
EndProcedure
